{"hotel_name": "The Grand Pacific Resort", "hotel_address": "789 Oceanview Drive, Malibu, CA 90265", "hotel_description": "A luxurious beachfront resort offering panoramic views of the Pacific Ocean. Perfect for couples and families seeking a premium coastal retreat. Features include infinity pools, private beach access, and world-class spa facilities.", "nearest_attractions": "Malibu Pier, Getty Villa, Point Dume State Beach, Zuma Beach"}
{"hotel_name": "Mountain Pine Lodge", "hotel_address": "456 Alpine Way, Aspen, CO 81611", "hotel_description": "Rustic yet elegant mountain retreat nestled in the Rockies. Ideal for ski enthusiasts and nature lovers. Offers ski-in/ski-out access, heated outdoor pools, and cozy fireside lounges.", "nearest_attractions": "Aspen Mountain, Maroon Bells, Independence Pass, Wheeler Opera House"}
{"hotel_name": "Urban Oasis Hotel", "hotel_address": "123 Downtown Boulevard, Chicago, IL 60601", "hotel_description": "Contemporary downtown hotel combining modern luxury with urban convenience. Perfect for business travelers and city explorers. Features include a rooftop bar, 24/7 fitness center, and smart room technology.", "nearest_attractions": "Millennium Park, Art Institute of Chicago, Navy Pier, Magnificent Mile"}
{"hotel_name": "Desert Mirage Resort", "hotel_address": "1001 Palm Springs Drive, Phoenix, AZ 85001", "hotel_description": "An elegant desert oasis featuring Southwestern architecture and modern amenities. Popular among golf enthusiasts and wellness seekers. Includes championship golf courses and desert spa treatments.", "nearest_attractions": "Desert Botanical Garden, Camelback Mountain, Phoenix Art Museum, Papago Park"}
{"hotel_name": "Historic Harbor Inn", "hotel_address": "567 Waterfront Street, Boston, MA 02110", "hotel_description": "Charming boutique hotel in a restored 19th-century building. Appeals to history buffs and cultural enthusiasts. Features original architecture with modern comforts and harbor views.", "nearest_attractions": "Faneuil Hall, Freedom Trail, New England Aquarium, Boston Harbor"}
{"hotel_name": "Tropical Paradise Resort", "hotel_address": "321 Coconut Beach Road, Maui, HI 96761", "hotel_description": "Authentic Hawaiian resort surrounded by lush tropical gardens. Perfect for honeymoons and family vacations. Offers traditional luaus, water sports, and cultural activities.", "nearest_attractions": "Lahaina Historic District, Haleakala National Park, Ka'anapali Beach, Molokini Crater"}
{"hotel_name": "Metropolitan Luxury Suites", "hotel_address": "888 Fifth Avenue, New York, NY 10022", "hotel_description": "Sophisticated high-rise hotel in the heart of Manhattan. Ideal for luxury travelers and shopping enthusiasts. Features butler service, michelin-starred dining, and Central Park views.", "nearest_attractions": "Central Park, Times Square, Metropolitan Museum of Art, Broadway Theaters"}
{"hotel_name": "Riverfront Renaissance Hotel", "hotel_address": "444 River Walk, New Orleans, LA 70130", "hotel_description": "Historic hotel blending French Quarter charm with modern luxury. Perfect for music lovers and food enthusiasts. Features jazz lounge, creole restaurant, and antique furnishings.", "nearest_attractions": "French Quarter, Bourbon Street, Jackson Square, Preservation Hall"}
{"hotel_name": "Pacific Northwest Lodge", "hotel_address": "789 Evergreen Way, Seattle, WA 98101", "hotel_description": "Contemporary lodge offering stunning views of Puget Sound and Mount Rainier. Appeals to outdoor enthusiasts and tech travelers. Features local art, craft beer bar, and eco-friendly design.", "nearest_attractions": "Space Needle, Pike Place Market, Chihuly Garden, Mount Rainier"}
{"hotel_name": "Vineyard Valley Resort", "hotel_address": "235 Wine Country Road, Napa, CA 94558", "hotel_description": "Elegant wine country retreat set among rolling vineyards. Perfect for wine enthusiasts and romantic getaways. Includes wine tasting room, culinary classes, and spa treatments.", "nearest_attractions": "Napa Valley Wine Train, Oxbow Public Market, Castello di Amorosa, Beringer Vineyards"}
{"hotel_name": "Coastal Breeze Inn", "hotel_address": "567 Ocean Drive, Miami Beach, FL 33139", "hotel_description": "Art deco boutique hotel steps from South Beach. Popular among fashion-forward travelers and beach lovers. Features retro-modern design, rooftop pool, and beach club access.", "nearest_attractions": "South Beach, Art Deco Historic District, Ocean Drive, Vizcaya Museum"}
{"hotel_name": "Rocky Mountain Resort", "hotel_address": "890 Mountain View Road, Banff, AB T1L 1K2", "hotel_description": "Majestic mountain lodge in the heart of Banff National Park. Ideal for outdoor adventurers and nature photographers. Offers guided hiking, wildlife viewing, and thermal springs access.", "nearest_attractions": "Lake Louise, Banff Gondola, Moraine Lake, Johnston Canyon"}
{"hotel_name": "Golden Gate Lodge", "hotel_address": "101 Bay View Drive, San Francisco, CA 94123", "hotel_description": "Boutique hotel offering panoramic views of the Golden Gate Bridge. Perfect for urban explorers and tech tourists. Features fog-free rooftop lounge and locally sourced cuisine.", "nearest_attractions": "Golden Gate Bridge, Fisherman's Wharf, Alcatraz Island, Chinatown"}
{"hotel_name": "Desert Springs Oasis", "hotel_address": "777 Canyon Road, Sedona, AZ 86336", "hotel_description": "Serene resort nestled among Sedona's red rocks. Popular with spiritual seekers and wellness enthusiasts. Includes meditation gardens, vortex tours, and holistic spa treatments.", "nearest_attractions": "Cathedral Rock, Chapel of the Holy Cross, Red Rock State Park, Verde Valley"}
{"hotel_name": "Lakeside Manor Resort", "hotel_address": "234 Lakeshore Drive, Lake Tahoe, NV 89449", "hotel_description": "Elegant lakefront resort offering year-round activities. Perfect for outdoor enthusiasts and families. Features private beach, ski shuttle, and water sports rentals.", "nearest_attractions": "Emerald Bay State Park, Heavenly Ski Resort, Lake Tahoe Nevada State Park, Tallac Historic Site"}
{"hotel_name": "Sakura Garden Hotel", "hotel_address": "2-1-1 Nihonbashi, Chuo-ku, Tokyo 103-0027", "hotel_description": "Traditional Japanese hotel blending ancient aesthetics with modern luxury. Perfect for cultural enthusiasts and business travelers. Features zen gardens, tea ceremony rooms, and onsen baths.", "nearest_attractions": "Sensoji Temple, Tokyo Skytree, Imperial Palace, Tsukiji Outer Market"}
{"hotel_name": "Nordic Lights Lodge", "hotel_address": "45 Aurora Street, Rovaniemi 96100, Finland", "hotel_description": "Glass-roofed arctic resort offering northern lights views. Ideal for adventure seekers and nature lovers. Features glass igloos, reindeer safaris, and arctic spa treatments.", "nearest_attractions": "Santa Claus Village, Arctic Circle, Arktikum Science Museum, Ounasvaara"}
{"hotel_name": "Outback Wilderness Resort", "hotel_address": "123 Red Earth Road, Alice Springs NT 0870, Australia", "hotel_description": "Luxury eco-resort in the heart of the Australian outback. Perfect for nature enthusiasts and adventure seekers. Offers aboriginal cultural tours, desert expeditions, and stargazing experiences.", "nearest_attractions": "Uluru-Kata Tjuta National Park, Kings Canyon, West MacDonnell Ranges, Alice Springs Desert Park"}
{"hotel_name": "Amalfi Coast Villa", "hotel_address": "Via Roma 45, Positano 84017, Italy", "hotel_description": "Cliffside boutique hotel overlooking the Mediterranean. Ideal for romantic getaways and food lovers. Features terraced gardens, infinity pools, and Michelin-starred dining.", "nearest_attractions": "Path of the Gods, Emerald Grotto, Positano Beach, Villa Rufolo"}
{"hotel_name": "Safari Plains Lodge", "hotel_address": "Private Reserve Road, Kruger Park 1350, South Africa", "hotel_description": "Luxury tented camp in a private game reserve. Perfect for wildlife enthusiasts and photographers. Includes guided safaris, bush dinners, and wellness treatments.", "nearest_attractions": "Kruger National Park, Blyde River Canyon, God's Window, Bourke's Luck Potholes"}
{"hotel_name": "Alpine Echo Resort", "hotel_address": "Dorfstrasse 27, Zermatt 3920, Switzerland", "hotel_description": "Traditional Swiss chalet with modern amenities and Matterhorn views. Popular with ski enthusiasts and mountain climbers. Features fondue restaurant, spa, and ski-to-door access.", "nearest_attractions": "Matterhorn, Gornergrat, Zermatt Village, Glacier Paradise"}
{"hotel_name": "Emerald Isle Castle", "hotel_address": "Castle Road, Killarney, Co. Kerry, Ireland", "hotel_description": "Historic castle hotel set in ancient woodlands. Perfect for history buffs and nature lovers. Offers falconry lessons, medieval banquets, and garden tours.", "nearest_attractions": "Killarney National Park, Ross Castle, Muckross House, Ring of Kerry"}
{"hotel_name": "Santorini Sunset Resort", "hotel_address": "Caldera Cliff 78, Oia 847 02, Greece", "hotel_description": "Whitewashed cave hotel carved into Santorini's caldera. Ideal for couples and photographers. Features infinity pools, sunset terraces, and traditional Greek cuisine.", "nearest_attractions": "Oia Castle, Amoudi Bay, Ancient Thera, Red Beach"}
{"hotel_name": "Rainforest Eco Lodge", "hotel_address": "Arenal Volcano Road, La Fortuna 21007, Costa Rica", "hotel_description": "Sustainable eco-lodge in the heart of the rainforest. Perfect for nature lovers and adventure seekers. Offers volcano hikes, canopy tours, and wildlife watching.", "nearest_attractions": "Arenal Volcano, La Fortuna Waterfall, Hot Springs, Hanging Bridges"}
{"hotel_name": "Moroccan Desert Camp", "hotel_address": "Route de Merzouga, Sahara Desert 52202, Morocco", "hotel_description": "Luxury desert camp with traditional Berber styling. Ideal for adventure travelers and cultural enthusiasts. Features camel treks, desert astronomy, and authentic Moroccan cuisine.", "nearest_attractions": "Erg Chebbi Dunes, Merzouga Village, Dayet Srji Salt Lake, Fossil Mountain"}
{"hotel_name": "Fjord View Hotel", "hotel_address": "Kongens Gate 5, Geiranger 6216, Norway", "hotel_description": "Contemporary hotel with panoramic fjord views. Perfect for nature photographers and outdoor enthusiasts. Offers fjord cruises, hiking trails, and Nordic cuisine.", "nearest_attractions": "Geirangerfjord, Seven Sisters Waterfall, Dalsnibba Viewpoint, Norwegian Fjord Centre"}
{"hotel_name": "Venetian Palace Hotel", "hotel_address": "Campo Santa Maria del Giglio 2467, Venice 30124, Italy", "hotel_description": "Historic palazzo converted into luxury hotel on the Grand Canal. Ideal for art lovers and romantic getaways. Features frescoed ceilings, private dock, and Venetian art collection.", "nearest_attractions": "St. Mark's Basilica, Doge's Palace, Rialto Bridge, Peggy Guggenheim Collection"}
{"hotel_name": "Bali Beach Resort", "hotel_address": "Jalan Pantai Kuta 100, Seminyak 80361, Indonesia", "hotel_description": "Tropical beachfront resort with traditional Balinese architecture. Perfect for wellness seekers and beach lovers. Offers yoga retreats, surf lessons, and spa treatments.", "nearest_attractions": "Tanah Lot Temple, Seminyak Beach, Potato Head Beach Club, Ubud Monkey Forest"}
{"hotel_name": "Canadian Wilderness Lodge", "hotel_address": "1 Moraine Lake Road, Lake Louise, AB T0L 1E0, Canada", "hotel_description": "Rustic-luxury lodge in the Canadian Rockies. Ideal for outdoor adventurers and wildlife watchers. Features helicopter tours, ice climbing, and wilderness spa.", "nearest_attractions": "Lake Louise, Moraine Lake, Icefields Parkway, Banff National Park"}
{"hotel_name": "Kyoto Garden Inn", "hotel_address": "45 Shimogamo, Sakyo-ku, Kyoto 606-0807, Japan", "hotel_description": "Traditional ryokan with contemporary comforts. Perfect for cultural enthusiasts and peace seekers. Features zen gardens, tatami rooms, and traditional kaiseki dining.", "nearest_attractions": "Kinkaku-ji Temple, Arashiyama Bamboo Grove, Fushimi Inari Shrine, Nijo Castle"}
{"hotel_name": "Andean Mountain Resort", "hotel_address": "Camino Sagrado 108, Cusco 08002, Peru", "hotel_description": "Mountain lodge with Incan architectural influences. Ideal for history buffs and altitude adventurers. Offers Inca Trail expeditions, local weaving classes, and oxygen-enriched rooms.", "nearest_attractions": "Machu Picchu, Sacred Valley, Cusco Cathedral, Sacsayhuamán"}
{"hotel_name": "Caribbean Paradise Resort", "hotel_address": "Seven Mile Beach Road, Grand Cayman KY1-1209", "hotel_description": "Luxury beachfront resort on pristine Caribbean shores. Perfect for water sports enthusiasts and sun seekers. Features coral reef diving, water sports center, and beach barbecues.", "nearest_attractions": "Stingray City, Seven Mile Beach, Cayman Crystal Caves, Rum Point"}
{"hotel_name": "Prague Castle Hotel", "hotel_address": "Hradčanské náměstí 15, Prague 11908, Czech Republic", "hotel_description": "Historic hotel in a restored medieval building. Popular with history enthusiasts and architecture lovers. Features gothic architecture, period furnishings, and castle views.", "nearest_attractions": "Prague Castle, Charles Bridge, St. Vitus Cathedral, Old Town Square"}
{"hotel_name": "Queenstown Adventure Lodge", "hotel_address": "45 Lake Esplanade, Queenstown 9300, New Zealand", "hotel_description": "Contemporary lodge overlooking Lake Wakatipu. Perfect for adrenaline seekers and nature lovers. Offers bungee jumping, skiing, and wilderness expeditions.", "nearest_attractions": "The Remarkables, Milford Sound, Coronet Peak, Skyline Gondola"}
{"hotel_name": "Dubai Marina Palace", "hotel_address": "Dubai Marina Walk 123, Dubai, UAE", "hotel_description": "Ultra-luxury hotel with futuristic design. Ideal for luxury travelers and shopping enthusiasts. Features infinity pools, gold-leaf spa treatments, and helicopter transfers.", "nearest_attractions": "Burj Khalifa, Dubai Mall, Palm Jumeirah, Dubai Marina"}
